# Задача №1. Решение в группах

# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.

# Input:
# n = 700
# m = 750

# Output:
# 2

n = 700

m = 750

#d = (m + n - 1)  это способ как мы решали на семинаре
#d = (m // n) + 1 это мой способ 
print(d)


