# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

S = int(input("Введите число журавликов, сделанных детьми: "))
if S%6 == 0:
  p = int(S / 6)
  s = int(S / 6)
  k = (p + s) * 2
  print("Катя сделала", k)
  print("Петя сделал", p)
  print("Сережа сделал",  s)
else: 
  print("Введены неверные данные")